#include <bits/stdc++.h>
using namespace std;

int main()
{
    int n;
    cin >> n;
    int a[n];

    for (int i = 0; i < n; i++)
    {
        cin >> a[i];
    }

    int mx = INT_MIN;

    for (int i = 0; i < n; i++)
    {
        mx = max(a[i], mx);
    }
    cout << mx;

    return 0;
}

/*
max ফাংশন কী করে?
max(x, y):
যদি x > y হয়, তাহলে x রিটার্ন করে।
যদি x <= y হয়, তাহলে y রিটার্ন করে।


প্রতিবার লুপ চলার সময়:

max ফাংশন পরীক্ষা করে:

যদি a[i] (বর্তমান উপাদান) mx (সর্বোচ্চ মান) থেকে বড় হয়, তাহলে নতুন মান হিসেবে a[i] সেট করে।
অন্যথায় mx একই থাকে।
এইভাবে mx সবসময় বর্তমান পর্যন্ত সবচেয়ে বড় মান ধারণ করে।


প্রোগ্রামের কাজের মূল বিষয়:
প্রথমে mx-কে INT_MIN দিয়ে ইনিশিয়ালাইজ করা হয়েছে, যাতে এটি সবসময় অ্যারের প্রথম উপাদান থেকে ছোট থাকে।
প্রতিটি উপাদান a[i] এবং mx এর মধ্যে তুলনা করা হয়।
সর্বোচ্চ মানটি আপডেট করে mx-এ রাখা হয়।
*/